Public Attributes | List of all members
API_VerticalLink Struct Reference
Element Manager
Option for anchoring the vertical position of an opening within the wall or the roof. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_VerticalLinkID  | linkType
Type of the vertical anchor.
 short  | linkValue
The index of the anchor story if linked to story, 0 otherwise.
Detailed Description
Option for anchoring the vertical position of an opening within the wall or the roof.
Remarks
This structure defines the vertical anchor
of a window/door element (see API_WindowType), to wall or story, by sill height or header,
of a skylight element (see API_SkylightType), to roof or story, by the selected anchor point.
Member Data Documentation
◆ linkType
 API_VerticalLink::linkType
Type of the vertical anchor.
 API_VerticalLinkID  | Meaning
 API_NoLink  | Undefined vertical link type, not applicable for windows/doors and skylights
 API_LinkSillToWallBottom  | Position the sill of the opening relative to the bottom of the containing wall
 API_LinkSillToStory  | Position the sill of the opening relative to a given story
 API_LinkHeaderToWallBottom  | Position the header of the opening relative to the bottom of the containing wall
 API_LinkHeaderToStory  | Position the header of the opening relative to a given story
 API_LinkSkylightToRoofPivot  | Position the skylight anchor vertically relative to the roof pivot lines
 API_LinkSkylightToStory  | Position the skylight anchor vertically relative to a given story
 API_LinkSkylightToShellBase  | Position the skylight anchor relative to ShellBase
 API_LinkSillToWallTop  | Position the sill of the opening relative to the top of the containing wall
 API_LinkHeaderToWallTop  | Position the header of the opening relative to the top of the containing wall